01/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_one
    {
        type            zeroGradient;
    	//type		fixedValue;
	//value		uniform (0.4 0 0);
    }
    inlet_two
    {
        type		zeroGradient;
	//type		fixedValue;
	//value		uniform (0.1 0 0);
    }
    outlet
    {
        type            zeroGradient;
	//type		fixedValue;
	//value		uniform (0.4 0 0);
    }


    walls
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
