01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001; 	// Medidas en mm

Zdim		-1; 	// Profundidad en Z (simulación 2d)
Xtot		100; 	// Largo total en X
Xent		15;	// Largo del tubo de entrada en X (agua)
Xent2		14;	// Largo del tubo de entrada en X (agroquimico)
Yent		5;	// Altura del tubo de entrada en Y (agua)
Yent2		3;	// Altura del tubo de entrada en la tobera (justo antes de la union de tubos)
Yint		6;	// Altura baja del tubo de entrada en Y (agroquímico)
Ytot		8;	// Altura total del dispositvo (máxima del tubo del agroquímico)
Xra0		25;	// Longitud de inicio de la rampa de acople de tubos
Xra1		30;	// Longitud final de la rampa de acople de tubos
Xra05		27.5;	// Longitud intermedia de la rampa
CeldasYent1	20;	// Cantidad de celdas en Y en entrada (agua)
CeldasXunion	35;	// Cantidad de celdas en X en la unión de los tubos
CeldasYent2	10;	// Cantidad de celdas en Y en entrada (agroquímico)

vertices
(
	(0 	0 	0) 	// 0
	($Xent 	0 	0) 	// 1
	($Xra1 	0 	0) 	// 2
	($Xtot 	0 	0) 	// 3
	($Xtot 	$Yent 	0) 	// 4
	($Xra1 	$Yent2 	0) 	// 5
	($Xra05	$Yint 	0)	// 6
	($Xra0 	$Ytot 	0)	// 7
	($Xent2	$Ytot 	0)	// 8
	(0 	$Ytot	0)	// 9
	(0	$Yint	0)	// 10
	($Xent2	$Yint	0)	// 11
	($Xent	$Yent2	0)	// 12
	(0	$Yent	0)	// 13

	(0 	0 	$Zdim) 	// 14 -> 0
	($Xent 	0 	$Zdim) 	// 15 -> 1
	($Xra1 	0 	$Zdim) 	// 16 -> 2
	($Xtot 	0 	$Zdim) 	// 17 -> 3
	($Xtot 	$Yent 	$Zdim) 	// 18 -> 4
	($Xra1 	$Yent2 	$Zdim) 	// 19 -> 5
	($Xra05	$Yint 	$Zdim)	// 20 -> 6
	($Xra0 	$Ytot 	$Zdim)	// 21 -> 7
	($Xent2	$Ytot 	$Zdim)	// 22 -> 8
	(0 	$Ytot	$Zdim)	// 23 -> 9
	(0	$Yint	$Zdim)	// 24 -> 10 
	($Xent2	$Yint	$Zdim)  // 25 -> 11
	($Xent	$Yent2	$Zdim)	// 26 -> 12
	(0	$Yent	$Zdim)	// 27 -> 13
);

blocks
(
	hex (0  13 12 1  14 27 26 15) ($CeldasYent1 15 1) simpleGrading (1 1 1) // inlet1
	hex (1  12 5  2  15 26 19 16) ($CeldasYent1 $CeldasXunion 1) simpleGrading (1 1 1) // tubo ppal - mezclador
	hex (2  5  4  3  16 19 18 17) ($CeldasYent1 40 1) simpleGrading (1 1 1) // salida
	hex (11 6  5  12 25 20 19 26) ($CeldasXunion 10 1) simpleGrading (1 1 1) // medio
	hex (8  7  6  11 22 21 20 25) ($CeldasXunion $CeldasYent2 1) simpleGrading (1 1 1) // alto
	hex (10 9  8  11 24 23 22 25) ($CeldasYent2 15 1) simpleGrading (1 1 1) // inlet2
);

edges
(
);
patches
(
	patch inlet_one
	(
		(0 13 27 14)
	)
	patch inlet_two
	(
		(10 9 23 24)
	)
	patch outlet
	(
		(3 17 18 4)
	)
	wall walls
	(
		(0 14 15 1)
		(1 15 16 2)
		(2 16 17 3)
		(5 4 18 19)
		(6 5 19 20)
		(7 6 20 21)
		(8 7 21 22)
		(9 8 22 23)
		(10 24 25 11)
	        (12 11 25 26)
		(13 12 26 27)	
	)
	empty frontAndBack
	(
		(0 1 12 13)
		(1 2 5 12)
		(2 3 4 5)
		(12 5 6 11)
		(11 6 7 8)
		(10 11 8 9)

		(14 27 26 15)
		(15 26 19 16)
		(16 19 18 17)
		(26 25 20 19)	
		(25 22 21 20)
		(24 23 22 25)
	)
);

mergePatchPairs
(
);

// ************************************************************************* //



